RhinoInside.Revit API Documentation
GeometryEncoder.ToLines Method
 Converts the specified Rhino.Geometry.Polyline to an equivalent array of Autodesk.Revit.DB.Line.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Line[] ToLines(
	this Rhino.Geometry.Polyline polyline
)
@staticmethod
def ToLines(
	polyline: Rhino.Geometry.Polyline
) -> Array[Autodesk.Revit.DB.Line]
Parameters
polyline
Type: Rhino.Geometry.Polyline
Rhino polyline to convert.
Return Value
Type: Autodesk.Revit.DB.Line[]
A Revit line array that is equivalent to the provided Rhino polyline.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Polyline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToLines(Polyline) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Line[] revitLines = rhinoPolyLine.ToLines();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System import Array
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_lines = rhino_polyline.ToLines()    # type: Array[DB.Line]
 Using ToLines(Polyline) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Line[] revitLines = GeometryEncoder.ToLines(rhinoPolyLine);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System import Array
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_lines = GE.ToLines(rhino_polyline)    # type: Array[DB.Line]
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace